{
    "title": [
        "Python for Beginners - Learn Python in 1 Hour",
        "Python for Beginners - Full Course Programming Tutorial",
        "Python As Fast as Possible - Learn Python in ~75 Minutes",
        "12 Beginner Python Projects - Coding Course",
        "Machine Learning for Everybody - Full Course",
        "Complete Machine Learning In 6 Hours | Krish Naik",
        "Harvard CS50s Artificial Intelligence with Python - Full University Course",
        "Generative AI Full Course - Gemini Pro, OpenAI, Llama, Langchain, Pinecone, Vector Databases & More",
        "Full Course Web Development [22 Hours] | Learn Full Stack Web Development From Scratch",
        "HTML & CSS Full Course | Web Development for Beginners",
        "Full Stack Web Development for Beginners (Full Course on HTML, CSS, JavaScript, Node.js, MongoDB)"
    ],
    "description": [
        "Complete Python tutorial for beginners with hands-on examples and practical projects",
        "Learn the Python programming language in this full course for beginners! You will learn the fundamentals of Python and code two Python programs line-by-line.",
        "This python tutorial aims to teach you python as fast as possible. This python speed course will cover all the fundamentals of python and give you a quick overview of all of the main python features.",
        "Improve your Python skills by following along with 12 different Python project tutorials.",
        "Learn Machine Learning in a way that is accessible to absolute beginners. You will learn the basics of Machine Learning and how to use TensorFlow to implement many different concepts.",
        "Complete Machine Learning Algorithms for Data Science",
        "This course from Harvard University explores the concepts and algorithms at the foundation of modern artificial intelligence",
        "Learn about generative models and different frameworks, investigating the production of text and visual material produced by artificial intelligence.",
        "This is full Stack Web Development Course for Absolute Beginners.",
        "In this video I teach you everything you need to know about web development with HTML & CSS so that you can start building your own amazing, modern and responsive websites today!",
        "Learn full-stack web development in this full course for beginners."
    ],
    "category": [
        "Programming",
        "Programming",
        "Programming",
        "Python Projects",
        "Machine Learning",
        "Machine Learning",
        "Artificial Intelligence",
        "Generative AI",
        "Web Development",
        "Web Development",
        "Web Development"
    ],
    "author": [
        "Programming with Mosh",
        "freeCodeCamp.org",
        "Tech With Tim",
        "freeCodeCamp.org",
        "freeCodeCamp.org",
        "Krish Naik",
        "freeCodeCamp.org",
        "freeCodeCamp.org",
        "Mehul - Codedamn",
        "Smoljames",
        "freeCodeCamp.org"
    ],
    "url": [
        "https://youtu.be/kqtD5dpn9C8?si=DSvCfl6dRml5jHYb",
        "https://youtu.be/eWRfhZUzrAc?si=ODLH6a-h4n3GN8kE",
        "https://youtu.be/VchuKL44s6E?si=W5TS9QUCx4hMwjLp",
        "https://youtu.be/8ext9G7xspg?si=LakI-0bwJf-Gh69i",
        "https://youtu.be/i_LwzRVP7bg?si=xdo-1pp_m7Uv-x8o",
        "https://youtu.be/JxgmHe2NyeY?si=I1RnC75RLlksC3x3",
        "https://youtu.be/5NgNicANyqM?si=ZnFcOzfgQ0cmaq1t",
        "https://youtu.be/mEsleV16qdo?si=nhJXrxAHz-lz2eFS",
        "https://youtu.be/ZxKM3DCV2kE?si=sFSNn9z5ZQOr9sVf",
        "https://youtu.be/Eb3lOiukwAQ?si=nuUA3NrXMvG-QwJr",
        "https://youtu.be/nu_pCVPKzTk?si=X3YM8fUdcW2w3_g6"
    ]
}